Documents/ПредставлениеКНаграде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПредставлениеКНаграде</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыПредставленийКНаградам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПротокола</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПротокола</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительКадровогоПодразделения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательствующийНаОбщемСобрании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МотивПоощрения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВручения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Согласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДолжностногоЛица</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеДолжности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПретендентыКНаграждению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Претендент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПретендентКНаграждению</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтажРаботыВОтрасли</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Награда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Награды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыПредставленияКНаградам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставитьКНаграде</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Награды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУстановкиСтатуса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/НаградыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НаградыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Награда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Награды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Награждение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗанятости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыЗанятости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтудентРаботающийВСтудотряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПредставлениеКНаграде/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Наградной лист: Форма №1.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "НаграднойЛистФорма1";
	КомандаПечати.Представление = НСтр("ru = 'Наградной лист (Форма №1)'");
	КомандаПечати.Порядок = 1;
	
	// Наградной лист: Форма №1 в формате Microsoft Word.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "НаграднойЛистФорма1(OfficeOpenXML)";
	КомандаПечати.Представление = НСтр("ru = 'Наградной лист (Форма №1) Office Open XML'");
	КомандаПечати.Картинка = БиблиотекаКартинок.ФорматWord2007;
	КомандаПечати.Порядок = 10;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	ОписаниеСостава = ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта();
	
	ОписаниеХранения = ЗарплатаКадрыСоставДокументов.ОписаниеХраненияСотрудниковФизическихЛиц();
	ОписаниеХранения.ИмяТаблицы = "ПретендентыКНаграждению";
	ОписаниеХранения.ПолеСотрудник = Неопределено;
	ОписаниеХранения.ПолеФизическоеЛицо = "Претендент";
	ОписаниеСостава.ОписаниеХраненияСотрудниковФизическихЛиц.Добавить(ОписаниеХранения);

	ОписаниеХранения = ЗарплатаКадрыСоставДокументов.ОписаниеХраненияСотрудниковФизическихЛиц();
	ОписаниеХранения.ИмяТаблицы = "ПретендентыКНаграждению";
	ОписаниеХранения.ПолеСотрудник = "Претендент";
	ОписаниеХранения.ПолеФизическоеЛицо = "Претендент";
	ОписаниеСостава.ОписаниеХраненияСотрудниковФизическихЛиц.Добавить(ОписаниеХранения);

	Возврат ОписаниеСостава;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НаграднойЛистФорма1") Тогда
		ДанныеПечатиОбъектов = ДанныеПечатиНаградногоЛиста(МассивОбъектов);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, "НаграднойЛистФорма1", НСтр("ru = 'Наградной лист (Форма № 1)'"), НаграднойЛист_Форма_1(МассивОбъектов, ОбъектыПечати, ДанныеПечатиОбъектов));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НаграднойЛистФорма1(OfficeOpenXML)") Тогда
		ФормированиеНаградногоЛиста(МассивОбъектов, КоллекцияПечатныхФорм);
	КонецЕсли;

КонецПроцедуры

// Подготавливает данные объекта к выводу на печать.
// 
// Параметры:
//  МассивДокументов - Массив - ссылки на объекты, для которых запрашиваются данные для печати;
//  МассивИменМакетов - Массив - имена макетов, в которые подставляются данные для печати.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - коллекция ссылок на объекты и их данные:
//   * Ключ - ЛюбаяСсылка - ссылка на объект информационной базы;
//   * Значение - Структура:
//    ** Ключ - Строка - имя макета,
//    ** Значение - Структура - данные объекта.
//
Функция ПолучитьДанныеПечати(Знач МассивДокументов, Знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;

	ДанныеПечатиОбъектов = ДанныеПечатиНаградногоЛиста(МассивДокументов);
	
	Для Каждого ОбъектСсылка Из МассивДокументов Цикл
		ДанныеОбъектаПоМакетам = Новый Соответствие;
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, ДанныеПечатиОбъектов.Получить(ОбъектСсылка));
		КонецЦикла;
		ДанныеПоВсемОбъектам.Вставить(ОбъектСсылка, ДанныеОбъектаПоМакетам);
	КонецЦикла;
	
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие; // Для обратной совместимости.
	
	Для Каждого ИмяМакета Из МассивИменМакетов Цикл
		Если ИмяМакета = "НаграднойЛистФорма1(OfficeOpenXML)" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, 
				УправлениеПечатью.МакетПечатнойФормы("Документ.ПредставлениеКНаграде.ПФ_DOC_НаграднойЛист_Форма1_ru"));
		КонецЕсли;
		ОписаниеОбластей.Вставить(ИмяМакета, ПолучитьОписаниеОбластейМакетаОфисногоДокумента());
	КонецЦикла;
	
	Макеты = Новый Структура;
	Макеты.Вставить("ОписаниеОбластей", ОписаниеОбластей);
	Макеты.Вставить("ТипыМакетов", ТипыМакетов); // Для обратной совместимости.
	Макеты.Вставить("ДвоичныеДанныеМакетов", ДвоичныеДанныеМакетов);
	
	Результат = Новый Структура;
	Результат.Вставить("Данные", ДанныеПоВсемОбъектам);
	Результат.Вставить("Макеты", Макеты);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОписаниеОбластейМакетаОфисногоДокумента()
	
	ОписаниеОбластей = Новый Структура;
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "УтверждениеКандидатуры",	"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал",					"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "СогласованоШапка",			"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "СогласованоСтрока",		"СтрокаТаблицы");
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка",					"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "НаименованиеНаграды",		"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ФИО",						"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ДолжностьМестоРаботы",		"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Пол",						"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "МестоРождения",			"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Образование",				"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "МестоРождения",			"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "УченаяСтепеньЗвание",		"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Награды",					"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ВедомственныеНаграды",		"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ДомашнийАдрес",			"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "СтажРаботы",				"Общая");
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ДополнительнаяСтрокаНаграды",	"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ДополнительнаяСтрока",			"Общая");
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ТрудоваяДеятельностьШапка",			"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ТрудоваяДеятельность",					"СтрокаТаблицы");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "РуководительКадровогоПодразделения",	"Общая");
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Характеристика",			"Общая");
	
	Возврат ОписаниеОбластей;
	
КонецФункции

Процедура ФормированиеНаградногоЛиста(МассивОбъектов, КоллекцияПечатныхФорм)
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "НаграднойЛистФорма1(OfficeOpenXML)");
	Если ПечатнаяФорма <> Неопределено Тогда
		ИмяМакета = "НаграднойЛистФорма1(OfficeOpenXML)";
		МакетИДанныеОбъекта = УправлениеПечатьюВызовСервера.МакетыИДанныеОбъектовДляПечати("Документ.ПредставлениеКНаграде", ИмяМакета, МассивОбъектов);
		ОфисныеДокументы = Новый Соответствие;
		
		Шаблон = НСтр("ru = 'Наградной лист: Форма №1 [НомерДокумента] - [Претендент] - [НомерПоПорядку]'");
		
		Для Каждого ОбъектПечати Из МассивОбъектов Цикл
			
			ПараметрыПечатиПретедентов = МакетИДанныеОбъекта.Данные[ОбъектПечати][ИмяМакета];
			Если ПараметрыПечатиПретедентов = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ПараметрыПечатиПретедента Из ПараметрыПечатиПретедентов Цикл
				
				ДанныеПечати = ПараметрыПечатиПретедента.ПараметрыПечати;
				
				Имя = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон,
						Новый Структура("НомерДокумента, Претендент, НомерПоПорядку", ОбъектПечати.Номер, ПараметрыПечатиПретедента.Претендент,
						ПараметрыПечатиПретедентов.Найти(ПараметрыПечатиПретедента)));
				АдресХранилищаОфисныйДокумент = НапечататьНаграднойЛист(ДанныеПечати, МакетИДанныеОбъекта, ИмяМакета);
				ОфисныеДокументы.Вставить(АдресХранилищаОфисныйДокумент, Имя);
				
			КонецЦикла;
			
			ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Наградной лист (Форма №1) Office Open XML'");
			ПечатнаяФорма.ОфисныеДокументы = ОфисныеДокументы;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция НапечататьНаграднойЛист(ДанныеПечати, МакетИДанныеОбъекта, ИмяМакета)
	
	ТипМакета				= МакетИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];
	ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
	Области					= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
	ДанныеОбъекта			= ДанныеПечати;
	
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], ТипМакета, ИмяМакета);
	Если Макет = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗакрытьОкноПечатнойФормы = Ложь;
	Попытка
		ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета, Макет);
		АдресХранилищаПечатнойФормы = "";
		Если ПечатнаяФорма = Неопределено Тогда
			УправлениеПечатью.ОчиститьСсылки(Макет);
			Возврат "";
		КонецЕсли;
		// Вывод обычных областей с параметрами.
		Если ИмяМакета = "НаграднойЛистФорма1(OfficeOpenXML)" Тогда
			ПолучениеЗаполнениеНаградногоЛиста(Макет, ИмяМакета, Области, ПечатнаяФорма, ДанныеОбъекта);
		КонецЕсли;

		АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗакрытьОкноПечатнойФормы = Истина;
		Возврат "";
	КонецПопытки;
	
	УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма, ЗакрытьОкноПечатнойФормы);
	УправлениеПечатью.ОчиститьСсылки(Макет);
	
	Возврат АдресХранилищаПечатнойФормы;
	
КонецФункции

Процедура ПолучениеЗаполнениеНаградногоЛиста(Макет, ИмяМакета, Области, ПечатнаяФорма, ДанныеОбъекта)
	
	Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["УтверждениеКандидатуры"]);
	УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
	
	Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Подвал"]);
	УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
	
	Если ДанныеОбъекта.Согласования.Количество() > 0 Тогда
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["СогласованоШапка"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["СогласованоСтрока"]);
		УправлениеПечатью.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФорма, Область, ДанныеОбъекта.Согласования, Ложь);
		
	КонецЕсли;
	
	ОбластиПечати = Новый Массив;
	ОбластиПечати.Добавить("Шапка");
	ОбластиПечати.Добавить("НаименованиеНаграды");
	ОбластиПечати.Добавить("ФИО");
	ОбластиПечати.Добавить("ДолжностьМестоРаботы");
	ОбластиПечати.Добавить("Пол");
	ОбластиПечати.Добавить("МестоРождения");
	ОбластиПечати.Добавить("Образование");
	ОбластиПечати.Добавить("УченаяСтепеньЗвание");
	ОбластиПечати.Добавить("Награды");
	ОбластиПечати.Добавить("ВедомственныеНаграды");
	ОбластиПечати.Добавить("ДомашнийАдрес");
	ОбластиПечати.Добавить("СтажРаботы");

	ПараметрыДополнительныхОбластей = ВыполнитьПереносПараметровПоСтрокам(ДанныеОбъекта);
	
	Для Каждого ИмяОбласти Из ОбластиПечати Цикл
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета][ИмяОбласти]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		ПараметрыДополнительнойОбласти = Неопределено;
		Если ПараметрыДополнительныхОбластей.Свойство(ИмяОбласти, ПараметрыДополнительнойОбласти) И Не ПараметрыДополнительнойОбласти = Неопределено Тогда

			Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета][ПараметрыДополнительнойОбласти.ИмяДополнительнойОбласти]);
			Для Каждого Параметр Из ПараметрыДополнительнойОбласти.Параметры Цикл
				ДополнительныеПараметры = Новый Структура("ДополнительныйПараметр", Параметр);
				УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДополнительныеПараметры, Ложь);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["ТрудоваяДеятельностьШапка"]);
	УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
	
	Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["ТрудоваяДеятельность"]);
	УправлениеПечатью.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФорма, Область, ДанныеОбъекта.ТрудоваяДеятельность, Ложь);
	
	Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["РуководительКадровогоПодразделения"]);
	УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
	
	Область = УправлениеПечатью.ОбластьМакета(Макет, Области[ИмяМакета]["Характеристика"]);
	УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
	
КонецПроцедуры

Функция НаграднойЛист_Форма_1(МассивОбъектов, ОбъектыПечати, ДанныеПечатиОбъектов)
	
	Макет = Документы.ПредставлениеКНаграде.ПолучитьМакет("ПФ_MXL_НаграднойЛист_Форма1");

	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.АвтоМасштаб = Истина;
	
	ОбластиПечати = Новый Массив;
	ОбластиПечати.Добавить("Шапка");
	ОбластиПечати.Добавить("НаименованиеНаграды");
	ОбластиПечати.Добавить("ФИО");
	ОбластиПечати.Добавить("ДолжностьМестоРаботы");
	ОбластиПечати.Добавить("Пол");
	ОбластиПечати.Добавить("МестоРождения");
	ОбластиПечати.Добавить("Образование");
	ОбластиПечати.Добавить("УченаяСтепеньЗвание");
	ОбластиПечати.Добавить("Награды");
	ОбластиПечати.Добавить("ВедомственныеНаграды");
	ОбластиПечати.Добавить("ДомашнийАдрес");
	ОбластиПечати.Добавить("СтажРаботы");
	
	ПервыйДокумент = Истина;
	Для Каждого ОбъектПечати Из МассивОбъектов Цикл
		
		ПараметрыПечатиПретедентов = ДанныеПечатиОбъектов.Получить(ОбъектПечати);
		Если ПараметрыПечатиПретедентов = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтрокиНачало = ДокументРезультат.ВысотаТаблицы + 1;
		
		Для Каждого ПараметрыПечатиПретедента Из ПараметрыПечатиПретедентов Цикл
			
			ТабличныйДокумент = Новый ТабличныйДокумент;
			
			ДанныеПечати = ПараметрыПечатиПретедента.ПараметрыПечати;
			
			ПараметрыДополнительныхОбластей = ВыполнитьПереносПараметровПоСтрокам(ДанныеПечати);
			
			ВывестиОбластиПечати(ТабличныйДокумент, Макет, ДанныеПечати, ОбластиПечати, ПараметрыДополнительныхОбластей);
			
			Область = Макет.ПолучитьОбласть("ТрудоваяДеятельностьШапка");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("ТрудоваяДеятельность");
			Для Каждого СтрокаТрудовойДеятельности Из ДанныеПечати.ТрудоваяДеятельность Цикл
				ЗаполнитьЗначенияСвойств(Область.Параметры, СтрокаТрудовойДеятельности);
				ТабличныйДокумент.Вывести(Область);
			КонецЦикла;
			
			ВывестиОбластиПечати(ТабличныйДокумент, Макет, ДанныеПечати, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("РуководительКадровогоПодразделения"), ПараметрыДополнительныхОбластей);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Область = Макет.ПолучитьОбласть("Характеристика");
			ТабличныйДокумент.Вывести(Область);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ВывестиОбластиПечати(ТабличныйДокумент, Макет, ДанныеПечати, СтрРазделить("УтверждениеКандидатуры,Подвал", ","), ПараметрыДополнительныхОбластей);
			
			Если Не ДанныеПечати.Согласования.Количество() = 0 Тогда
				Область = Макет.ПолучитьОбласть("СогласованоШапка");
				ТабличныйДокумент.Вывести(Область);
				Область = Макет.ПолучитьОбласть("СогласованоСтрока");
				Для Каждого СтрокаСогласования Из ДанныеПечати.Согласования Цикл
					ЗаполнитьЗначенияСвойств(Область.Параметры, СтрокаСогласования);
					ТабличныйДокумент.Вывести(Область);
				КонецЦикла;
			КонецЕсли;
			
			ДокументРезультат.Вывести(ТабличныйДокумент);
			
			ДокументРезультат.Рисунки[ДокументРезультат.Рисунки.Количество()-1].Текст = ДанныеПечати.ТекстХарактеристики;
			
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, НомерСтрокиНачало, ОбъектыПечати, ОбъектПечати);
		
		ПервыйДокумент = Ложь;
		
	КонецЦикла;
	
	Возврат ДокументРезультат;

КонецФункции

Процедура ВывестиОбластиПечати(ТабличныйДокумент, Макет, ДанныеПечати, ОбластиПечати, ПараметрыДополнительныхОбластей)
	
	Для Каждого ИмяОбласти Из ОбластиПечати Цикл
		
		Область = Макет.ПолучитьОбласть(ИмяОбласти);
		ЗаполнитьЗначенияСвойств(Область.Параметры, ДанныеПечати);
		ТабличныйДокумент.Вывести(Область);
		
		ПараметрыДополнительнойОбласти = Неопределено;
		Если ПараметрыДополнительныхОбластей.Свойство(ИмяОбласти, ПараметрыДополнительнойОбласти) И Не ПараметрыДополнительнойОбласти = Неопределено Тогда
			ДополнительнаяОбласть = Макет.ПолучитьОбласть(ПараметрыДополнительнойОбласти.ИмяДополнительнойОбласти);
			Для Каждого Параметр Из ПараметрыДополнительнойОбласти.Параметры Цикл
				ДополнительнаяОбласть.Параметры.ДополнительныйПараметр = Параметр;
				ТабличныйДокумент.Вывести(ДополнительнаяОбласть);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВыполнитьПереносПараметровПоСтрокам(ПараметрыПечати)
	
	СимволПробела = " ";
	ПустаяСтрока = "";
	
	СимволыРазделители = Новый Массив;
	СимволыРазделители.Добавить(СимволПробела);
	СимволыРазделители.Добавить(Символы.ПС);
	СимволыРазделители.Добавить(".");
	СимволыРазделители.Добавить(";");
	СимволыРазделители.Добавить(",");
	СимволыРазделители.Добавить("-");

	ОбластиСПереносами = "НаименованиеНаграды,ДолжностьМестоРаботы,МестоРождения,Образование,Награды,ВедомственныеНаграды,ДомашнийАдрес,УтверждениеКандидатуры";
	
	ПараметрыПереносаПоСтрокам = Новый Структура(ОбластиСПереносами);
	ПоляСтруктуры = "ИмяПараметра, КоличествоСимволовПоСтрокам";
	ПараметрыПереносаПоСтрокам.ДомашнийАдрес			= Новый Структура(ПоляСтруктуры, "АдресМестаПроживанияПредставление", СтрРазделить("51,71",","));
	ПараметрыПереносаПоСтрокам.ДолжностьМестоРаботы		= Новый Структура(ПоляСтруктуры, "ДолжностьМестоРаботы", СтрРазделить("42,71,71",","));
	ПараметрыПереносаПоСтрокам.Образование				= Новый Структура(ПоляСтруктуры, "Образование", СтрРазделить("55,71",","));
	ПараметрыПереносаПоСтрокам.Награды					= Новый Структура(ПоляСтруктуры, "Награды", СтрРазделить("71,71,71,71",","));
	ПараметрыПереносаПоСтрокам.ВедомственныеНаграды		= Новый Структура(ПоляСтруктуры, "ВедомственныеНаграды", СтрРазделить("51,71,71,71,71",","));
	ПараметрыПереносаПоСтрокам.МестоРождения 			= Новый Структура(ПоляСтруктуры, "МестоРождения", СтрРазделить("51,71",","));
	ПараметрыПереносаПоСтрокам.НаименованиеНаграды		= Новый Структура(ПоляСтруктуры, "НаименованиеНаграды", СтрРазделить("50,150",","));
	ПараметрыПереносаПоСтрокам.УтверждениеКандидатуры	= Новый Структура(ПоляСтруктуры, "НаимЮЛПолРод", СтрРазделить("71,71",","));
	
	КлючиСтруктурыДополнительныхОбластей = "ИмяДополнительнойОбласти,Параметры,КоличествоСимволов";
	ПараметрыДополнительныхОбластей = Новый Структура(ОбластиСПереносами);
	Для Каждого ИмяОбласти Из СтрРазделить(ОбластиСПереносами, ",") Цикл
		ПараметрыДополнительныхОбластей.Вставить(ИмяОбласти, Новый Структура(КлючиСтруктурыДополнительныхОбластей, "ДополнительнаяСтрока", Новый Массив, 71));
	КонецЦикла;
	ПараметрыДополнительныхОбластей.Вставить("НаименованиеНаграды", Новый Структура(КлючиСтруктурыДополнительныхОбластей, "ДополнительнаяСтрокаНаграды", Новый Массив, 35));

	Для Каждого ПараметрПереноса Из ПараметрыПереносаПоСтрокам Цикл
		
		ИмяПараметра = ПараметрПереноса.Значение.ИмяПараметра;

		Для НомерСтрокиПараметра = 1 По ПараметрПереноса.Значение.КоличествоСимволовПоСтрокам.Количество()-1 Цикл
			НаименованиеПараметра = СтрШаблон("%1%2", ИмяПараметра, Строка(НомерСтрокиПараметра));
			ПараметрыПечати.Вставить(НаименованиеПараметра, "");
		КонецЦикла;
		
		ИмяОбласти = ПараметрПереноса.Ключ;
		КоличествоСимволовПоСтрокам = ПараметрПереноса.Значение.КоличествоСимволовПоСтрокам;
		
		ЗначениеПараметра = Неопределено;
		ПараметрыПечати.Свойство(ИмяПараметра, ЗначениеПараметра);
		Если ЗначениеПараметра = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗначениеПараметра = Строка(ЗначениеПараметра);
		
		ЗаполнениеДопПараметров = Ложь;
		НомерСтрокиПараметра = 0;
		Пока Не ЗначениеПараметра = ПустаяСтрока Цикл
			
			Если Не ЗаполнениеДопПараметров И НомерСтрокиПараметра = КоличествоСимволовПоСтрокам.Количество() Тогда
				ЗаполнениеДопПараметров = Истина;
				НомерСтрокиПараметра = 0;
			КонецЕсли;

			
			КоличествоСимволовСтроки = ?(ЗаполнениеДопПараметров, ПараметрыДополнительныхОбластей[ИмяОбласти].КоличествоСимволов, Число(КоличествоСимволовПоСтрокам[НомерСтрокиПараметра]));
			ОптимальнаяПозицияСимвола = КоличествоСимволовСтроки;
			МинимальныйРазрыв = КоличествоСимволовСтроки;
			
			Если ОптимальнаяПозицияСимвола < СтрДлина(ЗначениеПараметра) Тогда
				
				Для Каждого СимволРазделитель Из СимволыРазделители Цикл
					
					ПозицияСимвола = СтрНайти(ЗначениеПараметра, СимволРазделитель, НаправлениеПоиска.СКонца, КоличествоСимволовСтроки);
					Если ПозицияСимвола = 0 Тогда
						ПозицияСимвола = СтрНайти(ЗначениеПараметра, СимволРазделитель,,КоличествоСимволовСтроки);
					КонецЕсли;
					Если ПозицияСимвола = 0 Тогда
						ПозицияСимвола = СтрДлина(ЗначениеПараметра);
					КонецЕсли;
					
					Коэффициент = ?(ПозицияСимвола>КоличествоСимволовСтроки,-1,1);
					Если Не ПозицияСимвола = 0 И (КоличествоСимволовСтроки - ПозицияСимвола)*Коэффициент < МинимальныйРазрыв Тогда
						МинимальныйРазрыв = (КоличествоСимволовСтроки - ПозицияСимвола)*Коэффициент;
						ОптимальнаяПозицияСимвола = ПозицияСимвола;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			ПереходСтроки = СтрНайти(ЗначениеПараметра, Символы.ПС);
			Если Не ПереходСтроки = 0 И ПереходСтроки < ОптимальнаяПозицияСимвола Тогда
				ОптимальнаяПозицияСимвола = ПереходСтроки;
			КонецЕсли;
			
			Если ЗаполнениеДопПараметров Тогда
				ПараметрыДополнительныхОбластей[ИмяОбласти].Параметры.Добавить(Лев(ЗначениеПараметра, ОптимальнаяПозицияСимвола));
			Иначе
				НаименованиеПараметра = СтрШаблон("%1%2", ИмяПараметра, ?(НомерСтрокиПараметра = 0, ПустаяСтрока, Строка(НомерСтрокиПараметра)));
				ПараметрыПечати.Вставить(НаименованиеПараметра, Лев(ЗначениеПараметра, ОптимальнаяПозицияСимвола));
			КонецЕсли;
			
			ЗначениеПараметра = Сред(ЗначениеПараметра, ОптимальнаяПозицияСимвола+1);
			
			НомерСтрокиПараметра = НомерСтрокиПараметра+1;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ПараметрыДополнительныхОбластей;
	
КонецФункции

Функция ДанныеПечатиНаградногоЛиста(МассивОбъектов)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПустаяДата = Дата(1,1,1);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПредставлениеКНаграде.Ссылка КАК Ссылка,
	|	ПредставлениеКНаграде.Номер КАК Номер,
	|	ПредставлениеКНаграде.Дата КАК Дата,
	|	ПредставлениеКНаграде.Организация КАК Организация,
	|	ПретендентыКНаграде.Претендент КАК Претендент,
	|	ВЫБОР
	|		КОГДА ПретендентыКНаграде.Претендент ССЫЛКА Справочник.Сотрудники
	|			ТОГДА ПретендентыКНаграде.Претендент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	КОНЕЦ КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ПретендентыКНаграде.Претендент ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ПретендентыКНаграде.Претендент
	|		ИНАЧЕ ЕСТЬNULL(СправочникФизическиеЛица.Ссылка, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	|	КОНЕЦ КАК ФизическоеЛицо,
	|	ПретендентыКНаграде.ПредставитьКНаграде КАК Награда,
	|	ПРЕДСТАВЛЕНИЕ(ПретендентыКНаграде.ПредставитьКНаграде) КАК НаименованиеНаграды,
	|	ПредставлениеКНаграде.НомерПротокола КАК НомерПротокола,
	|	ПредставлениеКНаграде.ДатаПротокола КАК ДатаПротокола,
	|	ПредставлениеКНаграде.РуководительКадровогоПодразделения КАК РуководительКадровогоПодразделения,
	|	ПредставлениеКНаграде.ПредседательствующийНаОбщемСобрании КАК ПредседательствующийНаОбщемСобрании,
	|	ПретендентыКНаграде.Характеристика КАК Характеристика,
	|	ПретендентыКНаграде.СтажРаботыВОтрасли КАК СтажРаботыВОтрасли,
	|	ЕСТЬNULL(Награды.ТипНаграды, """") КАК ТипНаграды
	|ПОМЕСТИТЬ ВТПредставленияКНаградам
	|ИЗ
	|	Документ.ПредставлениеКНаграде КАК ПредставлениеКНаграде
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПредставлениеКНаграде.ПретендентыКНаграждению КАК ПретендентыКНаграде
	|		ПО ПредставлениеКНаграде.Ссылка = ПретендентыКНаграде.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК СправочникФизическиеЛица
	|		ПО (СправочникФизическиеЛица.Ссылка = ВЫРАЗИТЬ(ПретендентыКНаграде.Претендент КАК Справочник.Сотрудники).ФизическоеЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Награды КАК Награды
	|		ПО (ПретендентыКНаграде.ПредставитьКНаграде = Награды.Ссылка)
	|ГДЕ
	|	ПредставлениеКНаграде.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредставлениеКНаграде.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КОНЕЦПЕРИОДА(ПредставлениеКНаграде.Дата, ДЕНЬ) КАК Период,
	|	НАЧАЛОПЕРИОДА(ПредставлениеКНаграде.Дата, ДЕНЬ) КАК НачалоПериода,
	|	НАЧАЛОПЕРИОДА(ПредставлениеКНаграде.Дата, ДЕНЬ) КАК ОкончаниеПериода
	|ПОМЕСТИТЬ ВТФизическиеЛицаПериоды
	|ИЗ
	|	ВТПредставленияКНаградам КАК ПредставлениеКНаграде
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредставлениеКНаграде.РуководительКадровогоПодразделения,
	|	КОНЕЦПЕРИОДА(ПредставлениеКНаграде.Дата, ДЕНЬ),
	|	НАЧАЛОПЕРИОДА(ПредставлениеКНаграде.Дата, ДЕНЬ),
	|	НАЧАЛОПЕРИОДА(ПредставлениеКНаграде.Дата, ДЕНЬ)
	|ИЗ
	|	ВТПредставленияКНаградам КАК ПредставлениеКНаграде
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредставлениеКНаградеСогласования.ДолжностноеЛицо,
	|	КОНЕЦПЕРИОДА(ПредставлениеКНаграде.Дата, ДЕНЬ),
	|	НАЧАЛОПЕРИОДА(ПредставлениеКНаграде.Дата, ДЕНЬ),
	|	НАЧАЛОПЕРИОДА(ПредставлениеКНаграде.Дата, ДЕНЬ)
	|ИЗ
	|	Документ.ПредставлениеКНаграде КАК ПредставлениеКНаграде
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПредставлениеКНаграде.Согласования КАК ПредставлениеКНаградеСогласования
	|		ПО ПредставлениеКНаграде.Ссылка = ПредставлениеКНаградеСогласования.Ссылка
	|ГДЕ
	|	ПредставлениеКНаграде.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредставлениеКНаграде.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТФизическиеЛица
	|ИЗ
	|	ВТПредставленияКНаградам КАК ПредставлениеКНаграде
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредставлениеКНаграде.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	ВТПредставленияКНаградам КАК ПредставлениеКНаграде";
	
	ФизическиеЛица = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	
	ОписаниеВТ = Новый Структура("ИмяВременнойТаблицыОтборовФизическихЛиц,ИмяПоляФизическоеЛицо",
		"ВТФизическиеЛица", "ФизическоеЛицо");
	ЗапросТрудоваяДеятельность = КадровыйУчетРасширенный.ЗапросВТТрудоваяДеятельностьФизическихЛиц(Истина, ОписаниеВТ);
	ЗапросТрудоваяДеятельность.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросТрудоваяДеятельность.Выполнить();
	
	ВидыОбразования = Новый Массив;
	ВидыОбразования.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразование);
	ВидыОбразования.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеБакалавриат);
	ВидыОбразования.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеПодготовкаКадровВысшейКвалификации);
	ВидыОбразования.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеСпециалитетМагистратура);
	ВидыОбразования.Добавить(Справочники.ВидыОбразованияФизическихЛиц.НачальноеПрофессиональноеОбразование);
	ВидыОбразования.Добавить(Справочники.ВидыОбразованияФизическихЛиц.СреднееПрофессиональноеОбразование);
	Запрос.УстановитьПараметр("ВидыОбразования", ВидыОбразования);

	ОписательОтборов = КадровыйУчет.ОписаниеВременнойТаблицыОтборовФизическихЛиц("ВТФизическиеЛица", "ФизическоеЛицо", Неопределено);
	КадровыйУчет.СоздатьВТОбразованияФизическихЛиц(Запрос.МенеджерВременныхТаблиц, Истина, ОписательОтборов, "ВТОбразованияФЛ");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТрудоваяДеятельность.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТрудоваяДеятельность.ДатаНачала КАК ДатаНачала,
	|	ТрудоваяДеятельность.ДатаОкончания КАК ДатаОкончания,
	|	ТрудоваяДеятельность.Организация КАК Организация,
	|	ТрудоваяДеятельность.Должность КАК Должность,
	|	ТрудоваяДеятельность.АдресОрганизации КАК АдресОрганизации,
	|	ЛОЖЬ КАК Образование
	|ИЗ
	|	ВТТрудоваяДеятельностьФизическихЛиц КАК ТрудоваяДеятельность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбразованияФизическихЛиц.ФизическоеЛицо,
	|	ОбразованияФизическихЛиц.Начало,
	|	ОбразованияФизическихЛиц.Окончание,
	|	ПРЕДСТАВЛЕНИЕ(ОбразованияФизическихЛиц.УчебноеЗаведение.ПолноеНаименование),
	|	NULL,
	|	NULL,
	|	ИСТИНА
	|ИЗ
	|	ВТОбразованияФЛ КАК ОбразованияФизическихЛиц
	|ГДЕ
	|	ОбразованияФизическихЛиц.ВидОбразования В(&ВидыОбразования)";
	
	ТрудоваяДеятельностьФизическихЛиц = Запрос.Выполнить().Выгрузить();
	ТрудоваяДеятельностьФизическихЛиц.Колонки.Добавить("ПериодРаботы", Новый ОписаниеТипов("Строка"));
	ТрудоваяДеятельностьФизическихЛиц.Колонки.Добавить("ДолжностьОрганизация", Новый ОписаниеТипов("Строка"));

	Для Каждого СтрокаТрудовойДеятельности Из ТрудоваяДеятельностьФизическихЛиц Цикл
		
		МассивЗначений = Новый Массив;
		Если Не СтрокаТрудовойДеятельности.ДатаНачала = ПустаяДата Тогда
			МассивЗначений.Добавить(Формат(СтрокаТрудовойДеятельности.ДатаНачала, "ДФ=MM.yyyy"));
		КонецЕсли;
		Если Не СтрокаТрудовойДеятельности.ДатаОкончания = ПустаяДата Тогда
			МассивЗначений.Добавить(Формат(СтрокаТрудовойДеятельности.ДатаОкончания, "ДФ=MM.yyyy"));
		КонецЕсли;
		СтрокаТрудовойДеятельности.ПериодРаботы = СтрСоединить(МассивЗначений, НСтр("ru = '-'"));
		
		МассивЗначений = Новый Массив;
		Если ЗначениеЗаполнено(СтрокаТрудовойДеятельности.Должность) Тогда
			МассивЗначений.Добавить(СтрокаТрудовойДеятельности.Должность);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТрудовойДеятельности.Организация)Тогда
			Если СтрокаТрудовойДеятельности.Образование Тогда
				МассивЗначений.Добавить(СтрШаблон(НСтр("ru = 'Обучение в %1'"), СклонениеПредставленийОбъектов.ПросклонятьПредставление(СтрокаТрудовойДеятельности.Организация, 6)));
			Иначе
				МассивЗначений.Добавить(СтрокаТрудовойДеятельности.Организация);
			КонецЕсли;
		КонецЕсли;
		СтрокаТрудовойДеятельности.ДолжностьОрганизация = СтрСоединить(МассивЗначений, НСтр("ru = ', '"));
		
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбразованияФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПРЕДСТАВЛЕНИЕ(ОбразованияФизическихЛиц.ВидОбразования) КАК ВидОбразования,
	|	ОбразованияФизическихЛиц.Окончание КАК ДатаОкончания,
	|	ПРЕДСТАВЛЕНИЕ(ОбразованияФизическихЛиц.УчебноеЗаведение.ПолноеНаименование) КАК УчебноеЗаведение,
	|	ПРЕДСТАВЛЕНИЕ(ОбразованияФизическихЛиц.Специальность.ПолноеНаименование) КАК Специальность
	|ИЗ
	|	ВТОбразованияФЛ КАК ОбразованияФизическихЛиц
	|ГДЕ
	|	ОбразованияФизическихЛиц.ВидОбразования В(&ВидыОбразования)";
	
	ОбразованияФЛ = Запрос.Выполнить().Выгрузить();
	ОбразованияФЛ.Колонки.Добавить("ОбразованиеПредставление", Новый ОписаниеТипов("Строка"));
	Для Каждого СтрокаОбразования Из ОбразованияФЛ Цикл
		МассивЗначений = Новый Массив;
		Если Не СтрокаОбразования.ВидОбразования = "" Тогда
			МассивЗначений.Добавить(СтрокаОбразования.ВидОбразования);
		КонецЕсли;
		Если Не СтрокаОбразования.УчебноеЗаведение = "" Тогда
			МассивЗначений.Добавить(СтрокаОбразования.УчебноеЗаведение);
		КонецЕсли;
		Если Не СтрокаОбразования.ДатаОкончания = ПустаяДата Тогда
			МассивЗначений.Добавить(Формат(СтрокаОбразования.ДатаОкончания, "ДФ='yyyy ""г"".'"));
		КонецЕсли;
		СтрокаОбразования.ОбразованиеПредставление = СтрСоединить(МассивЗначений, НСтр("ru = ', '"));
	КонецЦикла;
	
	КадровыеДанныеФизичесикихЛиц = 
	"Фамилия,ФамилияИО,
	|Имя,
	|Отчество,
	|ФИО,
	|Пол,
	|ДатаРождения,
	|МестоРождения,
	|УченоеЗвание,
	|УченаяСтепень,
	|ОбщийСтажЛет,
	|АдресМестаПроживанияПредставление,
	|АдресМестаПроживания,
	|АдресПоПропискеПредставление";
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, "ВТФизическиеЛицаПериоды");
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Истина, КадровыеДанныеФизичесикихЛиц);

	ПараметрыПолученияКадровыхДанных = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоВременнойТаблице();
	ПараметрыПолученияКадровыхДанных.КадровыеДанные = "ВидЗанятости, Организация";
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияКадровыхДанных, "ВТСотрудникиОрганизаций");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Согласования.ДолжностноеЛицо КАК ДолжностноеЛицо,
	|	Согласования.НаименованиеДолжности КАК НаименованиеДолжности,
	|	ЕСТЬNULL(КадровыеДанныеФизическихЛиц.ФамилияИО, """") КАК ФамилияИнициалы,
	|	Согласования.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПредставлениеКНаграде.Согласования КАК Согласования
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
	|		ПО Согласования.ДолжностноеЛицо = КадровыеДанныеФизическихЛиц.ФизическоеЛицо
	|ГДЕ
	|	Согласования.Ссылка В(&МассивОбъектов)";
	СогласованияНаградныхЛистов = Запрос.Выполнить().Выгрузить();

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПредставленияКНаградам.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА СотрудникиОрганизаций.Сотрудник
	|		ИНАЧЕ ПредставленияКНаградам.Сотрудник
	|	КОНЕЦ КАК Сотрудник,
	|	КОНЕЦПЕРИОДА(ПредставленияКНаградам.Дата, ДЕНЬ) КАК Период,
	|	КОНЕЦПЕРИОДА(ПредставленияКНаградам.Дата, ДЕНЬ) КАК НачалоПериода,
	|	КОНЕЦПЕРИОДА(ПредставленияКНаградам.Дата, ДЕНЬ) КАК ОкончаниеПериода
	|ПОМЕСТИТЬ ВТСотрудникиПериоды
	|ИЗ
	|	ВТПредставленияКНаградам КАК ПредставленияКНаградам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ПО ПредставленияКНаградам.ФизическоеЛицо = СотрудникиОрганизаций.ФизическоеЛицо
	|			И ПредставленияКНаградам.Организация = СотрудникиОрганизаций.Организация
	|			И (СотрудникиОрганизаций.ВидЗанятости В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство)))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредставленияКНаградам.РуководительКадровогоПодразделения,
	|	КОНЕЦПЕРИОДА(ПредставленияКНаградам.Дата, ДЕНЬ),
	|	КОНЕЦПЕРИОДА(ПредставленияКНаградам.Дата, ДЕНЬ),
	|	КОНЕЦПЕРИОДА(ПредставленияКНаградам.Дата, ДЕНЬ)
	|ИЗ
	|	ВТПредставленияКНаградам КАК ПредставленияКНаградам";
	Запрос.Выполнить();

	КадровыеДанныеСотрудников = 
	"Должность,
	|ФамилияИО";
	
	ОписательВременныхТаблиц = 
		КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
			Запрос.МенеджерВременныхТаблиц,
			"ВТСотрудникиПериоды");

	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанныеСотрудников);
	
	ПараметрыЗапроса = КадровыйУчет.ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоВременнойТаблице();
	ПараметрыЗапроса.ПериодВОдинДень = Истина;
	КадровыйУчет.СоздатьВТРабочиеМестаСотрудниковПоВременнойТаблице(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыЗапроса, "ВТРабочиеМестаСотрудников");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПредставлениеКНаграде.Ссылка КАК Ссылка,
	|	ПредставлениеКНаграде.Номер КАК Номер,
	|	ПредставлениеКНаграде.Дата КАК Дата,
	|	ПредставлениеКНаграде.Организация КАК Организация,
	|	ПредставлениеКНаграде.Претендент КАК Претендент,
	|	ПредставлениеКНаграде.Сотрудник КАК Сотрудник,
	|	ПредставлениеКНаграде.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПредставлениеКНаграде.Награда КАК Награда,
	|	ПредставлениеКНаграде.ТипНаграды КАК ТипНаграды,
	|	ПредставлениеКНаграде.НаименованиеНаграды КАК НаименованиеНаграды,
	|	ПредставлениеКНаграде.НомерПротокола КАК НомерПротокола,
	|	ПредставлениеКНаграде.ДатаПротокола КАК ДатаПротокола,
	|	ПредставлениеКНаграде.РуководительКадровогоПодразделения КАК РуководительКадровогоПодразделения,
	|	ПРЕДСТАВЛЕНИЕ(ПредставлениеКНаграде.ПредседательствующийНаОбщемСобрании) КАК ПредседательствующийНаОбщемСобрании,
	|	ПредставлениеКНаграде.Характеристика КАК Характеристика,
	|	ПредставлениеКНаграде.СтажРаботыВОтрасли КАК СтажРаботыВОтрасли,
	|	КадровыеДанныеФизическихЛиц.Фамилия КАК Фамилия,
	|	КадровыеДанныеФизическихЛиц.Имя КАК Имя,
	|	КадровыеДанныеФизическихЛиц.Отчество КАК Отчество,
	|	КадровыеДанныеФизическихЛиц.ФИО КАК ФИО,
	|	КадровыеДанныеФизическихЛиц.ФамилияИО КАК ФамилияИО,
	|	КадровыеДанныеФизическихЛиц.Пол КАК Пол,
	|	КадровыеДанныеФизическихЛиц.ДатаРождения КАК ДатаРождения,
	|	КадровыеДанныеФизическихЛиц.МестоРождения КАК МестоРождения,
	|	ЕСТЬNULL(КадровыеДанныеСотрудников.Должность, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) КАК Должность,
	|	КадровыеДанныеФизическихЛиц.УченоеЗвание КАК УченоеЗвание,
	|	КадровыеДанныеФизическихЛиц.УченаяСтепень КАК УченаяСтепень,
	|	КадровыеДанныеФизическихЛиц.ОбщийСтажЛет КАК ОбщийСтажЛет,
	|	КадровыеДанныеФизическихЛиц.АдресМестаПроживанияПредставление КАК АдресМестаПроживанияПредставление,
	|	КадровыеДанныеФизическихЛиц.АдресМестаПроживания КАК АдресМестаПроживания,
	|	ЕСТЬNULL(РабочиеМестаСотрудников.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНазначения,
	|	ЕСТЬNULL(ДанныеРуководителяКадровогоПодразделения.Должность, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) КАК ДолжностьРуководителяКадровогоПодразделения,
	|	ЕСТЬNULL(ДанныеРуководителяКадровогоПодразделения.ФамилияИО, """") КАК ФИОРуководителяКадровогоПодразделения
	|ИЗ
	|	ВТПредставленияКНаградам КАК ПредставлениеКНаграде
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочиеМестаСотрудников КАК РабочиеМестаСотрудников
	|		ПО ПредставлениеКНаграде.ФизическоеЛицо = РабочиеМестаСотрудников.ФизическоеЛицо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
	|		ПО ПредставлениеКНаграде.ФизическоеЛицо = КадровыеДанныеФизическихЛиц.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|		ПО ПредставлениеКНаграде.ФизическоеЛицо = КадровыеДанныеСотрудников.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК ДанныеРуководителяКадровогоПодразделения
	|		ПО ПредставлениеКНаграде.РуководительКадровогоПодразделения = ДанныеРуководителяКадровогоПодразделения.Сотрудник";
	
	ДанныеОбъектовПечати = Запрос.Выполнить().Выгрузить();
	
	ПараметрыПечатиОбъектов = Новый Соответствие;
	
	Для Каждого ОбъектПечати Из МассивОбъектов Цикл
		
		ДанныеОбъектаПечати = ДанныеОбъектовПечати.НайтиСтроки(Новый Структура("Ссылка", ОбъектПечати));
		
		ПараметрыПечатиПретедентов = Новый Массив;
		
		Для Каждого ДанныеОбъекта Из ДанныеОбъектаПечати Цикл
			
			ДанныеОбОрганизации = ЗарплатаКадры.СведенияОбОрганизации(ДанныеОбъекта.Организация, "ОргСубъект,НаимЮЛПол,ДолжнРук,ФамилияРук,ИмяРук,ОтчествоРук");
			НаимЮЛПолРод = СклонениеПредставленийОбъектов.ПросклонятьПредставление(ДанныеОбОрганизации.НаимЮЛПол, 2);
			ТипНаградыТвор = СклонениеПредставленийОбъектов.ПросклонятьПредставление(ДанныеОбъекта.ТипНаграды, 5);
			
			ЗаполняемыеПараметры = 
			"СтажРаботыВОтрасли,
			|ФИОРуководителяКадровогоПодразделения,
			|НомерПротокола,
			|Фамилия,
			|Имя,
			|Отчество,
			|Пол,
			|ОбщийСтажЛет,
			|ФИО,
			|ФамилияИО,
			|АдресМестаПроживанияПредставление";
			
			ПараметрыПечати = ПараметрыПечатиНаградногоЛиста();
			ЗаполнитьЗначенияСвойств(ПараметрыПечати, ДанныеОбъекта, ЗаполняемыеПараметры);
			ЗаполнитьЗначенияСвойств(ПараметрыПечати, ДанныеОбОрганизации, "ОргСубъект");
			
			ПараметрыПечати.НаимЮЛПолРод = НаимЮЛПолРод;
			ПараметрыПечати.ПредседательствующийНаОбщемСобрании = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ДанныеОбъекта.ПредседательствующийНаОбщемСобрании);
			
			СутьНаграды = СокрЛП(СтрЗаменить(ДанныеОбъекта.НаименованиеНаграды, ДанныеОбъекта.ТипНаграды, ""));
			ПараметрыПечати.НаименованиеНаграды = СтрШаблон("%1%2%3", ДанныеОбъекта.ТипНаграды, Символы.ПС, СутьНаграды);
			ПараметрыПечати.ТипНаградыТвор = ТипНаградыТвор;
			ПараметрыПечати.СутьНаграды = СутьНаграды;
			
			ПараметрыПечати.ДатаРождения = Формат(ДанныеОбъекта.ДатаРождения, "ДФ=dd.MM.yyyy");
			
			Если ЗначениеЗаполнено(ДанныеОбъекта.Должность) Тогда
				ПараметрыПечати.ДолжностьМестоРаботы = СтрШаблон(НСтр("ru = '%1 %2'"), ДанныеОбъекта.Должность, НаимЮЛПолРод);
			КонецЕсли;
			
			УченаяСтепеньЗвание = Новый Массив;
			Если ЗначениеЗаполнено(ДанныеОбъекта.УченаяСтепень) Тогда
				УченаяСтепеньЗвание.Добавить(ДанныеОбъекта.УченаяСтепень);
			КонецЕсли;
			Если ЗначениеЗаполнено(ДанныеОбъекта.УченоеЗвание) Тогда
				УченаяСтепеньЗвание.Добавить(ДанныеОбъекта.УченоеЗвание);
			КонецЕсли;
			
			Если Не УченаяСтепеньЗвание.Количество() = 0 Тогда
				ПараметрыПечати.УченаяСтепеньЗвание = СтрСоединить(УченаяСтепеньЗвание, НСтр("ru = ', '"));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеОбъекта.ДатаНазначения) Тогда
				ПараметрыПечати.СтажРаботыВДолжности = Год(ДанныеОбъекта.Дата)-Год(ДанныеОбъекта.ДатаНазначения);
				Если ПараметрыПечати.СтажРаботыВДолжности > 0 И ДеньГода(ДанныеОбъекта.Дата) < ДеньГода(ДанныеОбъекта.ДатаНазначения) Тогда
					ПараметрыПечати.СтажРаботыВДолжности = ПараметрыПечати.СтажРаботыВДолжности - 1;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеОбъекта.ДолжностьРуководителяКадровогоПодразделения) Тогда
				ПараметрыПечати.ДолжностьРуководителяКадровогоПодразделения = СтрШаблон(НСтр("ru = '%1 %2'"), ДанныеОбъекта.ДолжностьРуководителяКадровогоПодразделения, НаимЮЛПолРод);
			КонецЕсли;
			
			ПараметрыПечати.ДатаДень = Формат(ДанныеОбъекта.Дата, "ДФ=dd");
			ПараметрыПечати.ДатаМесяцПрописью = Формат(ДанныеОбъекта.Дата, "ДФ='дд ММММ'");
			ПараметрыПечати.ДатаМесяцПрописью = СокрЛП(СтрЗаменить(ПараметрыПечати.ДатаМесяцПрописью,ПараметрыПечати.ДатаДень,""));
			ПараметрыПечати.ДатаГод =  Формат(ДанныеОбъекта.Дата, "ДФ=yyyy");
			
			ПараметрыПечати.ДатаПротоколаДень = Формат(ДанныеОбъекта.ДатаПротокола, "ДФ=dd");
			ПараметрыПечати.ДатаПротоколаМесяцПрописью = Формат(ДанныеОбъекта.ДатаПротокола, "ДФ='дд ММММ'");
			ПараметрыПечати.ДатаПротоколаМесяцПрописью = СокрЛП(СтрЗаменить(ПараметрыПечати.ДатаМесяцПрописью,ПараметрыПечати.ДатаДень,""));
			ПараметрыПечати.ДатаПротоколаГод =  Формат(ДанныеОбъекта.ДатаПротокола, "ДФ=yyyy");
			
			Если ЗначениеЗаполнено(ДанныеОбОрганизации.ДолжнРук) Тогда
				ПараметрыПечати.ДолжностьРуководителя = СтрШаблон(НСтр("ru = '%1 %2'"), ДанныеОбОрганизации.ДолжнРук, НаимЮЛПолРод);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СокрЛП(ДанныеОбОрганизации.ФамилияРук)) Тогда
				Инициалы = "";
				Если ЗначениеЗаполнено(ДанныеОбОрганизации.ИмяРук) Тогда
					Инициалы = СтрШаблон(НСтр("ru = '%1.'"), Лев(СокрЛП(ДанныеОбОрганизации.ИмяРук),1));
					Если ЗначениеЗаполнено(ДанныеОбОрганизации.ОтчествоРук) Тогда
						Инициалы = СтрШаблон(НСтр("ru = '%1%2.'"), Инициалы, Лев(СокрЛП(ДанныеОбОрганизации.ОтчествоРук),1));
					КонецЕсли;
				КонецЕсли;
				ПараметрыПечати.РуководительОрганизацииФамилияИнициалы = СтрШаблон(НСтр("ru = '%1 %2'"), СокрЛП(ДанныеОбОрганизации.ФамилияРук), Инициалы);
			КонецЕсли;
			
			ПараметрыПечати.ДолжностьПредседательствующего = СтрШаблон(НСтр("ru = 'Председательствующий на общем  собрании коллектива организации, ее  совета или собрании  участников %1'"), НаимЮЛПолРод);
			
			МуниципальноеПредставлениеАдреса = РаботаСАдресами.СведенияОбАдресе(ДанныеОбъекта.АдресМестаПроживания).МуниципальноеПредставление;
			Если Не МуниципальноеПредставлениеАдреса = "" Тогда
				ПараметрыПечати.АдресМестаПроживанияПредставление = МуниципальноеПредставлениеАдреса;
			КонецЕсли;
			
			ТрудоваяДеятельность = ТрудоваяДеятельностьФизическихЛиц.НайтиСтроки(Новый Структура("ФизическоеЛицо", ДанныеОбъекта.ФизическоеЛицо));
			ПараметрыПечати.ТрудоваяДеятельность = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТрудоваяДеятельностьФизическихЛиц.Скопировать(ТрудоваяДеятельность));
			
			ОбразованиеФизическогоЛица = ОбразованияФЛ.НайтиСтроки(Новый Структура("ФизическоеЛицо", ДанныеОбъекта.ФизическоеЛицо));
			ОбразованиеФизическогоЛица = ОбразованияФЛ.Скопировать(ОбразованиеФизическогоЛица, "ОбразованиеПредставление");
			ОбразованиеФизическогоЛица = ОбразованиеФизическогоЛица.ВыгрузитьКолонку("ОбразованиеПредставление");
			ПараметрыПечати.Образование = СтрСоединить(ОбразованиеФизическогоЛица,  СтрШаблон(НСтр("ru = '%1'"),Символы.ПС));
			
			НаградыФизическихЛиц = РегистрыСведений.НаградыФизическихЛиц.НаградыФизическихЛиц(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеОбъекта.ФизическоеЛицо), ОбъектПечати.Дата);
			НаградыФизическихЛиц.Колонки.Добавить("НаименованиеНаграды", Новый ОписаниеТипов("Строка"));
			Для Каждого СтрокаНаграды Из НаградыФизическихЛиц Цикл
				МассивЗначений = Новый Массив;
				МассивЗначений.Добавить(СтрокаНаграды.ПредставлениеНаграды);
				МассивЗначений.Добавить(Формат(СтрокаНаграды.ДатаПриказа, "ДФ='yyyy ""г.""'"));
				СтрокаНаграды.НаименованиеНаграды = СтрСоединить(МассивЗначений, НСтр("ru = ', '"));
			КонецЦикла;
			
			НаградыРФ = НаградыФизическихЛиц.НайтиСтроки(Новый Структура("КатегорияНаграды", Справочники.КатегорииНаград.ГосударственнаяНаградаРФ));
			НаградыРФ = НаградыФизическихЛиц.Скопировать(НаградыРФ, "НаименованиеНаграды, ДатаПриказа");
			НаградыРФ.Сортировать("ДатаПриказа");
			НаградыРФ = НаградыРФ.ВыгрузитьКолонку("НаименованиеНаграды");
			
			НаградыСССР = НаградыФизическихЛиц.НайтиСтроки(Новый Структура("КатегорияНаграды", Справочники.КатегорииНаград.ГосударственнаяНаградаСССР));
			НаградыСССР = НаградыФизическихЛиц.Скопировать(НаградыСССР, "НаименованиеНаграды, ДатаПриказа");
			НаградыСССР.Сортировать("ДатаПриказа");
			НаградыСССР = НаградыСССР.ВыгрузитьКолонку("НаименованиеНаграды");
			
			НаградыРСФСР = НаградыФизическихЛиц.НайтиСтроки(Новый Структура("КатегорияНаграды", Справочники.КатегорииНаград.ГосударственнаяНаградаРСФСР));
			НаградыРСФСР = НаградыФизическихЛиц.Скопировать(НаградыРСФСР, "НаименованиеНаграды, ДатаПриказа");
			НаградыРСФСР.Сортировать("ДатаПриказа");
			НаградыРСФСР = НаградыРСФСР.ВыгрузитьКолонку("НаименованиеНаграды");
			
			Разделитель = "#";
			Награды = СтрШаблон("%1%2%3%4%5", СтрСоединить(НаградыРФ, Разделитель), Разделитель, СтрСоединить(НаградыСССР, Разделитель), Разделитель, СтрСоединить(НаградыРСФСР, Разделитель));
			Награды = СтрРазделить(Награды, Разделитель, Ложь);
			
			Если Награды.Количество() = 0 Тогда
				ПараметрыПечати.Награды = ?(ДанныеОбъекта.Пол = Перечисления.ПолФизическогоЛица.Женский, НСтр("ru = 'Не награждалась'"), НСтр("ru = 'Не награждался'"));
			Иначе
				ПараметрыПечати.Награды = СтрСоединить(Награды, Символы.ПС);
			КонецЕсли;
			
			ВедомственныеНаграды = НаградыФизическихЛиц.НайтиСтроки(Новый Структура("КатегорияНаграды", Справочники.КатегорииНаград.ВедомственнаяНаградаРФ));
			ВедомственныеНаграды = НаградыФизическихЛиц.Скопировать(ВедомственныеНаграды, "НаименованиеНаграды");
			ВедомственныеНаграды = ВедомственныеНаграды.ВыгрузитьКолонку("НаименованиеНаграды");
			
			РегиональныеНаграды = НаградыФизическихЛиц.НайтиСтроки(Новый Структура("КатегорияНаграды", Справочники.КатегорииНаград.РегиональнаяНаграда));
			РегиональныеНаграды = НаградыФизическихЛиц.Скопировать(РегиональныеНаграды, "НаименованиеНаграды");
			РегиональныеНаграды = РегиональныеНаграды.ВыгрузитьКолонку("НаименованиеНаграды");
			
			Разделитель = "#";
			Награды = СтрШаблон("%1%2%3", СтрСоединить(ВедомственныеНаграды, Разделитель), Разделитель, СтрСоединить(РегиональныеНаграды, Разделитель));
			Награды = СтрРазделить(Награды, Разделитель, Ложь);
			
			Если Награды.Количество() = 0 Тогда
				ПараметрыПечати.ВедомственныеНаграды = ?(ДанныеОбъекта.Пол = Перечисления.ПолФизическогоЛица.Женский, НСтр("ru = 'Не награждалась'"), НСтр("ru = 'Не награждался'"));
			Иначе
				ПараметрыПечати.ВедомственныеНаграды = СтрСоединить(Награды, Символы.ПС);
			КонецЕсли;
			
			ПараметрыПечати.МестоРождения = ПерсонифицированныйУчетКлиентСервер.ПредставлениеМестаРождения(ДанныеОбъекта.МестоРождения);
			
			ТекстХарактеристики = ДанныеОбъекта.Характеристика;
			Пока Не ТекстХарактеристики = "" Цикл
				СимволовАбзаца = СтрНайти(ТекстХарактеристики, Символы.ПС);
				Если СимволовАбзаца = 0 Тогда
					СимволовАбзаца =  СтрДлина(ТекстХарактеристики);
				КонецЕсли;
				ПараметрыПечати.Характеристика.Добавить(Лев(ТекстХарактеристики, СимволовАбзаца));
				ТекстХарактеристики = Сред(ТекстХарактеристики, СимволовАбзаца+1);
			КонецЦикла;
			
			СогласованияНаградногоЛиста = СогласованияНаградныхЛистов.НайтиСтроки(Новый Структура("Ссылка", ОбъектПечати));
			СогласованияНаградногоЛиста = СогласованияНаградныхЛистов.Скопировать(СогласованияНаградногоЛиста);
			ПараметрыПечати.Согласования = ОбщегоНазначения.ТаблицаЗначенийВМассив(СогласованияНаградногоЛиста);
			
			ТекстХарактеристики = ОбщегоНазначения.ЗначениеИзСтрокиXML(ДанныеОбъекта.Характеристика);
			Если ТипЗнч(ТекстХарактеристики) = Тип("ФорматированныйДокумент") Тогда
				ПараметрыПечати.ТекстХарактеристики = ТекстХарактеристики.ПолучитьФорматированнуюСтроку();
				ПараметрыПечати.ТекстХарактеристикиФорматированныйДокумент = ТекстХарактеристики.ПолучитьТекст();
			КонецЕсли;
			
			ПараметрыПечатиПретедентов.Добавить(Новый Структура("Претендент, ПараметрыПечати", ДанныеОбъекта.Претендент, ПараметрыПечати));
			
		КонецЦикла;
		
		ПараметрыПечатиОбъектов.Вставить(ОбъектПечати, ПараметрыПечатиПретедентов);
			
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПараметрыПечатиОбъектов;
		
КонецФункции
	
Функция ПараметрыПечатиНаградногоЛиста()
	
	ПараметрыПечатнойФормы = Новый Структура;
	ПараметрыПечатнойФормы.Вставить("ОргСубъект");
	ПараметрыПечатнойФормы.Вставить("НаименованиеНаграды");
	ПараметрыПечатнойФормы.Вставить("ФИО");
	ПараметрыПечатнойФормы.Вставить("ФамилияИО");
	ПараметрыПечатнойФормы.Вставить("Фамилия");
	ПараметрыПечатнойФормы.Вставить("Имя");
	ПараметрыПечатнойФормы.Вставить("Отчество");
	ПараметрыПечатнойФормы.Вставить("ДолжностьМестоРаботы");
	ПараметрыПечатнойФормы.Вставить("Пол");
	ПараметрыПечатнойФормы.Вставить("ДатаРождения");
	ПараметрыПечатнойФормы.Вставить("МестоРождения");
	ПараметрыПечатнойФормы.Вставить("УченаяСтепеньЗвание", НСтр("ru = 'Не имеет'"));
	ПараметрыПечатнойФормы.Вставить("АдресМестаПроживанияПредставление");
	ПараметрыПечатнойФормы.Вставить("ОбщийСтажЛет");
	ПараметрыПечатнойФормы.Вставить("СтажРаботыВОтрасли");
	ПараметрыПечатнойФормы.Вставить("СтажРаботыВДолжности");
	ПараметрыПечатнойФормы.Вставить("ДолжностьРуководителяКадровогоПодразделения");
	ПараметрыПечатнойФормы.Вставить("ФИОРуководителяКадровогоПодразделения");
	ПараметрыПечатнойФормы.Вставить("ДатаДень");
	ПараметрыПечатнойФормы.Вставить("ДатаМесяцПрописью");
	ПараметрыПечатнойФормы.Вставить("ДатаГод");
	ПараметрыПечатнойФормы.Вставить("ТипНаградыТвор");
	ПараметрыПечатнойФормы.Вставить("НаименованиеНаграды");
	ПараметрыПечатнойФормы.Вставить("СутьНаграды");
	ПараметрыПечатнойФормы.Вставить("НаимЮЛПолРод");
	ПараметрыПечатнойФормы.Вставить("НомерПротокола");
	ПараметрыПечатнойФормы.Вставить("ДатаПротоколаДень");
	ПараметрыПечатнойФормы.Вставить("ДатаПротоколаМесяцПрописью");
	ПараметрыПечатнойФормы.Вставить("ДатаПротоколаГод");
	ПараметрыПечатнойФормы.Вставить("ДолжностьРуководителя");
	ПараметрыПечатнойФормы.Вставить("РуководительОрганизацииФамилияИнициалы	");
	ПараметрыПечатнойФормы.Вставить("ПредседательствующийНаОбщемСобрании");
	ПараметрыПечатнойФормы.Вставить("ДолжностьПредседательствующего");
	ПараметрыПечатнойФормы.Вставить("ТрудоваяДеятельность", Новый Массив);
	ПараметрыПечатнойФормы.Вставить("Награды");
	ПараметрыПечатнойФормы.Вставить("ВедомственныеНаграды");
	ПараметрыПечатнойФормы.Вставить("Образование");
	ПараметрыПечатнойФормы.Вставить("Характеристика", Новый Массив);
	ПараметрыПечатнойФормы.Вставить("Согласования", Новый Массив);
	ПараметрыПечатнойФормы.Вставить("ТекстХарактеристикиФорматированныйДокумент");
	ПараметрыПечатнойФормы.Вставить("ТекстХарактеристики");
	
	Возврат ПараметрыПечатнойФормы;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
